---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainNonSeqIntersWithDivLines
source: html/8c823a6a-d617-6f4b-3369-24d3fb06850f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainNonSeqIntersWithDivLines Property

The chain formed by these curve elements has multiple non-sequential intersections with the same gridline and will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainNonSeqIntersWithDivLines { get; }
```